[
  {
    "title": "1. Phantom Blood (Jonathan Joestar)",
    "start": 1,
    "end": 9,
    "summary": "Set in late 19th-century England, Phantom Blood follows Jonathan Joestar and his adoptive brother, Dio Brando. When Dio uses the mysterious Stone Mask to become a vampire, Jonathan must master the Ripple (Hamon) technique to stop him. Themes of honor, rivalry, and tragedy define this first arc."
  },
  {
    "title": "2. Battle Tendency (Joseph Joestar)",
    "start": 10,
    "end": 26,
    "summary": "Taking place in the 1930s, this arc follows Joseph Joestar, Jonathan’s quick-witted grandson. Joseph battles ancient beings called the Pillar Men, who seek the Red Stone of Aja to achieve ultimate power. Using his cunning, humor, and Hamon, Joseph travels across the world to prevent their rise."
  },
  {
    "title": "3. Stardust Crusaders (Jotaro Kujo)",
    "start": 27,
    "end": 74,
    "summary": "In the late 1980s, Jotaro Kujo discovers he has a Stand, a powerful psychic manifestation. Alongside his grandfather Joseph, and allies Avdol, Kakyoin, and Polnareff, he travels from Japan to Egypt to defeat the resurrected Dio before his mother dies from a Stand-related illness."
  },
  {
    "title": "4. Diamond Is Unbreakable (Josuke Higashikata)",
    "start": 75,
    "end": 113,
    "summary": "Set in the quiet town of Morioh in 1999, this arc follows Josuke Higashikata, Joseph’s illegitimate son, and his friends as they track down Stand users created by a mysterious bow and arrow. Their investigation leads to the discovery of Yoshikage Kira, a serial killer hiding in plain sight."
  },
  {
    "title": "5. Golden Wind (Giorno Giovanna)",
    "start": 114,
    "end": 152,
    "summary": "In 2001 Italy, Giorno Giovanna, Dio’s son with Jonathan’s body, aspires to become a 'Gang-Star' and reform the mafia from within. He joins Bucciarati’s team, fighting deadly Stand-using assassins as they protect the boss’s daughter and uncover the boss’s true identity."
  },
  {
    "title": "6. Stone Ocean (Jolyne Cujoh)",
    "start": 153,
    "end": 190,
    "summary": "In 2011 Florida, Jolyne Cujoh, Jotaro’s daughter, is imprisoned after being framed for murder. Inside the prison, she learns of a plot by Dio’s loyal priest, Enrico Pucci, to reset the universe. With new allies, she fights to stop Pucci’s plan and save her father."
  }
]
